zhuranlan/Rt-Thread1.2.2-RTGUI/rt-thread-1.2.2/rt-thread-1.2.2/bsp/stm32f40x/drivers/board.h
/*
 * File      : board.h
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2009, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-09-22     Bernard      add board.h to this bsp
 */

// <<< Use Configuration Wizard in Context Menu >>>
#ifndef __BOARD_H__
#define __BOARD_H__

#include <stm32f4xx.h>

/* board configuration */
// <o> SDCard Driver <1=>SDIO sdcard <0=>SPI MMC card
// 	<i>Default: 1
#define STM32_USE_SDIO			0

///* whether use board external SRAM memory */
//// <e>Use external SRAM memory on the board
//// 	<i>Enable External SRAM memory
//#define STM32_EXT_SRAM          0
////	<o>Begin Address of External SRAM
////		<i>Default: 0x68000000
//#define STM32_EXT_SRAM_BEGIN    0x68000000 /* the begining address of external SRAM */
////	<o>End Address of External SRAM
////		<i>Default: 0x68080000
//#define STM32_EXT_SRAM_END      0x68080000 /* the end address of external SRAM */
// </e>
//#define STM32_EXT_SRAM         1
//#define STM32_EXT_SRAM_BEGIN    0x10000000 
//#define STM32_EXT_SRAM_END      0x10010000

// <o> Internal SRAM memory size[Kbytes] <8-64>
//	<i>Default: 64
#define STM32_SRAM_SIZE         128
#define STM32_SRAM_END          (0x20000000 + STM32_SRAM_SIZE * 1024)

#define RT_USING_UART1
#define RT_USING_UART2
//#define RT_USING_UART3
#define RT_USING_UART4
#define RT_USING_UART6

// <o> Console on USART: <0=> no console <1=>USART 1 <2=>USART 2 <3=> USART 3
// 	<i>Default: 1
#define STM32_CONSOLE_USART		2

void rt_hw_board_init(void);

#if STM32_CONSOLE_USART == 0
#define CONSOLE_DEVICE "no"
#elif STM32_CONSOLE_USART == 1
#define CONSOLE_DEVICE "uart1"
#elif STM32_CONSOLE_USART == 2
#define CONSOLE_DEVICE "uart2"
#elif STM32_CONSOLE_USART == 3
#define CONSOLE_DEVICE "uart3"
#elif STM32_CONSOLE_USART == 4
#define CONSOLE_DEVICE "uart4"
#elif STM32_CONSOLE_USART == 6
#define CONSOLE_DEVICE "uart6"
#endif

#define FINSH_DEVICE_NAME   CONSOLE_DEVICE

void rt_hw_usart_init(void);

/* SD Card init function */
void rt_hw_msd_init(void);

#endif

// <<< Use Configuration Wizard in Context Menu >>>
